In [ ]:
# pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

# pymysql

In [8]:
import pymysql
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞
con = pymysql.connect(host='localhost', user='root', password='1234',  db='my_db',
 charset='utf8') # ÌïúÍ∏ÄÏ≤òÎ¶¨ (charset = 'utf8‚Äô)
con

In [10]:
# Ïª§ÏÑú ÏÉùÏÑ±
cursor = con.cursor()
cursor

In [ ]:
sql_query = """SELECT e.ename AS ÏÇ¨ÏõêÏù¥Î¶Ñ, 
            d.dname AS ÏÜåÏÜçÎ∂ÄÏÑúÏù¥Î¶Ñ, 
            e.sal AS Í∏âÏó¨, 
            e.job AS ÏßÅÎ¨¥
        FROM emp e
        JOIN dept d ON e.deptno = d.deptno;"""

cursor.execute(sql_query)
result = cursor.fetchall()
result

('CLARK', 'ACCOUNTING', Decimal('2450.00'), 'MANAGER')
('KING', 'ACCOUNTING', Decimal('5000.00'), 'PRESIDENT')
('MILLER', 'ACCOUNTING', Decimal('1300.00'), 'CLERK')
('SMITH', 'RESEARCH', Decimal('800.00'), 'CLERK')
('JONES', 'RESEARCH', Decimal('2975.00'), 'MANAGER')
('SCOTT', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ADAMS', 'RESEARCH', Decimal('1100.00'), 'CLERK')
('FORD', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ALLEN', 'SALES', Decimal('1600.00'), 'SALESMAN')
('WARD', 'SALES', Decimal('1250.00'), 'SALESMAN')
('MARTIN', 'SALES', Decimal('1250.00'), 'SALESMAN')
('BLAKE', 'SALES', Decimal('2850.00'), 'MANAGER')
('TURNER', 'SALES', Decimal('1500.00'), 'SALESMAN')
('JAMES', 'SALES', Decimal('950.00'), 'CLERK')

In [17]:
import pandas as pd
df = pd.DataFrame(result)
df

         0           1        2          3
0    CLARK  ACCOUNTING  2450.00    MANAGER
1     KING  ACCOUNTING  5000.00  PRESIDENT
2   MILLER  ACCOUNTING  1300.00      CLERK
3    SMITH    RESEARCH   800.00      CLERK
4    JONES    RESEARCH  2975.00    MANAGER
5    SCOTT    RESEARCH  3000.00    ANALYST
6    ADAMS    RESEARCH  1100.00      CLERK
7     FORD    RESEARCH  3000.00    ANALYST
8    ALLEN       SALES  1600.00   SALESMAN
9     WARD       SALES  1250.00   SALESMAN
10  MARTIN       SALES  1250.00   SALESMAN
11   BLAKE       SALES  2850.00    MANAGER
12  TURNER       SALES  1500.00   SALESMAN
13   JAMES       SALES   950.00      CLERK

In [ ]:
# Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
cursor.close()
con.close()

# MySQLdb (mysqlclient)

In [3]:
# pip install mysqlclient

In [5]:
import MySQLdb
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞
db_config = {
'host' :'localhost',  # Ìò∏Ïä§Ìä∏ Ïù¥Î¶Ñ
'user' : 'root', # MySQL ÏÇ¨Ïö©Ïûê Ïù¥Î¶Ñ
'passwd' : '1234', # MySQL ÏÇ¨Ïö©Ïûê ÎπÑÎ∞ÄÎ≤àÌò∏
'db' : 'my_db', # Ïó∞Í≤∞Ìï† Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§ Ïù¥Î¶Ñ
'charset' : 'utf8'
}
print('hello')

hello

In [6]:
try:
    conn = MySQLdb.connect(**db_config) # Ïª§ÏÑú ÏÉùÏÑ±
    cursor = conn.cursor() # ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
    sql_query = "SELECT * FROM dept"
    cursor.execute(sql_query) # ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
    result = cursor.fetchall() # Í≤∞Í≥º Ï∂úÎ†•
    for row in result:
        print(row)
except MySQLdb.Error as e:
    print(f"Error: {e}")
finally: # Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
    cursor.close()
    conn.close()

(10, 'ACCOUNTING', 'NEW YORK')
(20, 'RESEARCH', 'DALLAS')
(30, 'SALES', 'CHICAGO')
(40, 'OPERATIONS', 'BOSTON')

# mysql.connector

In [7]:
# pip install mysql-connector-python

In [8]:
import mysql.connector
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞

conn = mysql.connector.connect(
 host='localhost', # Ìò∏Ïä§Ìä∏ Ïù¥Î¶Ñ
 user='root', # MySQL ÏÇ¨Ïö©Ïûê Ïù¥Î¶Ñ
 password='1234', # MySQL ÏÇ¨Ïö©Ïûê ÎπÑÎ∞ÄÎ≤àÌò∏
 database='my_db' # Ïó∞Í≤∞Ìï† Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§ Ïù¥Î¶Ñ
)
# Ïª§ÏÑú ÏÉùÏÑ±
cursor = conn.cursor()
# ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
sql_query = "SELECT * FROM dept"
cursor.execute(sql_query)
# ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
result = cursor.fetchall()
# Í≤∞Í≥º Ï∂úÎ†•
for row in result:
 print(row)
# Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
cursor.close()
conn.close()

(10, 'ACCOUNTING', 'NEW YORK')
(20, 'RESEARCH', 'DALLAS')
(30, 'SALES', 'CHICAGO')
(40, 'OPERATIONS', 'BOSTON')

# SQLAlchemy (ORM Í∏∞Î∞ò)

In [10]:
# pip install sqlalchemy pymysql

In [12]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+pymysql://root:1234@localhost/my_db")
engine

Engine(mysql+pymysql://root:***@localhost/my_db)

In [13]:
df = pd.read_sql("SHOW TABLES IN my_db;", engine)
df

  Tables_in_my_db
0            dept
1             emp
2        salgrade

In [16]:
tables = pd.read_sql("SELECT * FROM dept", engine)
tables.head()

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [ ]:
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

In [18]:
# ORM Í∏∞Î≥∏ ÌÅ¥ÎûòÏä§ ÏÉùÏÑ±
Base = declarative_base()

C:\Users\Admin\AppData\Local\Temp\ipykernel_9308\2681860153.py:2: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

In [19]:
# products ÌÖåÏù¥Î∏î Ï†ïÏùò
class Product(Base):
    __tablename__ = 'products_1'

    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(100), nullable=False)
    price = Column(Integer, nullable=False)
    stock = Column(Integer, nullable=False)

    def __repr__(self):
        return f"<Product(id={self.id}, name='{self.name}', price={self.price}, stock={self.stock})>"

In [20]:
# ÌÖåÏù¥Î∏î ÏÉùÏÑ±
Base.metadata.create_all(engine)

In [ ]:
# ÏÑ∏ÏÖò ÏÑ§Ï†ï
Session = sessionmaker(bind=engine)
session = Session()

In [ ]:
# CREATE: ÏÉÅÌíà Îì±Î°ù
def add_product(name, price, stock):
    new_product = Product(name=name, price=price, stock=stock)
    session.add(new_product) # insert
    session.commit()
    print(f"üÜï '{name}' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!")


add_product("Î°§Î¶¨Ìåù", 500, 10)
add_product("Ìï´Ï¥àÏΩî", 2000, 10)

üÜï 'Î°§Î¶¨Ìåù' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!
üÜï 'Ìï´Ï¥àÏΩî' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!

In [23]:
# READ: ÏÉÅÌíà Ï°∞Ìöå
def list_products():
    products = session.query(Product).all()  # select
    for p in products:
        print(p)

list_products()

<Product(id=1, name='Î°§Î¶¨Ìåù', price=500, stock=10)>
<Product(id=2, name='Ìï´Ï¥àÏΩî', price=2000, stock=10)>

In [24]:
# UPDATE: Í∞ÄÍ≤© ÏàòÏ†ï
def update_price(product_id, new_price):
    product = session.query(Product).get(product_id)
    if product:
        product.price = new_price
        session.commit()
        print(f"üí∏ {product.name}Ïùò Í∞ÄÍ≤©Ïù¥ {new_price}ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.")
    else:
        print("‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.")

update_price(2, 3000)

üí∏ Ìï´Ï¥àÏΩîÏùò Í∞ÄÍ≤©Ïù¥ 3000ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_9308\3777426224.py:3: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [25]:
# ÏÑ∏ÏÖòÏùò Î∞òÎÇ©
try:
    # ÏûëÏóÖ
    product = session.query(Product).get(1)
    product.price += 500
    session.commit()
except Exception as e:
    session.rollback()
    print("ÏòàÏô∏ Î∞úÏÉù, Î°§Î∞±:", e)
finally:
    session.close()
    print("ÏÑ∏ÏÖò Ï¢ÖÎ£å")

ÏÑ∏ÏÖò Ï¢ÖÎ£å

C:\Users\Admin\AppData\Local\Temp\ipykernel_9308\1924863495.py:4: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(1)